{"format": "layers-model", "generatedBy": "keras v2.6.0", "convertedBy": "TensorFlow.js Converter v3.9.0", "modelTopology": {"keras_version": "2.6.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 28, 28], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_0"}, "name": "input_0", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"name": "49_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "49_pad", "inbound_nodes": [[["input_0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "49", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "49", "inbound_nodes": [[["49_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "33", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "33", "inbound_nodes": [[["49", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "34", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "name": "34", "inbound_nodes": [[["33", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "52_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "52_pad", "inbound_nodes": [[["34", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "52", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "52", "inbound_nodes": [[["52_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "37", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "37", "inbound_nodes": [[["52", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "38", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "name": "38", "inbound_nodes": [[["37", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "55_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "55_pad", "inbound_nodes": [[["38", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "55", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "55", "inbound_nodes": [[["55_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "41", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "41", "inbound_nodes": [[["55", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "42", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "name": "42", "inbound_nodes": [[["41", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "58_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "58_pad", "inbound_nodes": [[["42", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "58", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "58", "inbound_nodes": [[["58_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "45", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "45", "inbound_nodes": [[["58", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "46", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "name": "46", "inbound_nodes": [[["45", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "47", "trainable": true, "dtype": "float32", "target_shape": [-1]}, "name": "47", "inbound_nodes": [[["46", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "output_0", "trainable": true, "dtype": "float32", "units": 26, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "output_0", "inbound_nodes": [[["47", 0, 0, {}]]]}], "input_layers": [["input_0", 0, 0]], "output_layers": [["output_0", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "49/kernel", "shape": [3, 3, 1, 16], "dtype": "float32"}, {"name": "49/bias", "shape": [16], "dtype": "float32"}, {"name": "52/kernel", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "52/bias", "shape": [32], "dtype": "float32"}, {"name": "55/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "55/bias", "shape": [64], "dtype": "float32"}, {"name": "58/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "58/bias", "shape": [128], "dtype": "float32"}, {"name": "output_0/kernel", "shape": [128, 26], "dtype": "float32"}, {"name": "output_0/bias", "shape": [26], "dtype": "float32"}]}]}